height = int(input("Введите свой рост в сантиметрах:"))
weight = height - 100
print("Ваш вес: " + str(weight))
trueweight = int(input("Введите свой вес:"))
if weight==trueweight:
    print("Ваш вес в пределах нормы")
elif weight>trueweight:
    print("Рекомендация набрать вес")
else:
    print("Рекомендация сбросить вес")
#/////////////////////////////////////////////////////////////////////////////////////////////////
a = int(input("Введите длину стороны a: "))
b = int(input("Введите длину стороны b: "))
c = int(input("Введите длину стороны c: "))
if a==b==c:
    print("Треугольник равносторонний")
elif (a==b or a==c or b==c):
    print("Треугольник равнобедренный")
else:
    print("Треугольник разносторонний")
#/////////////////////////////////////////////////////////////////////////////////////////////////
num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))
num3 = float(input("Введите третье число: "))
if num1 % 2==0:
    num1 = (num1/2)
elif num1==1:
    num1=2
if num2 % 2==0:
    num2 = (num2/2)
elif num2==1:
    num2=2
if num3 % 2==0:
    num3= (num3/2)
elif num3==1:
    num3=2
print("Измененные числа")
print(f"Первое число: {num1}")
print(f"Второе число: {num2}")
print(f"Третье число: {num3}")
#/////////////////////////////////////////////////////////////////////////////////////////////////
year = int(input("Введите год: "))
if year%4==0:
    print("год весокосный")
else:
    print("Год не весокосный")
#/////////////////////////////////////////////////////////////////////////////////////////////////
number1 = int(input("Введите ваше число: "))
if number1%2==0:
    print("Число четное")
else: print("Число не четное")
#/////////////////////////////////////////////////////////////////////////////////////////////////
#Zadanie_1(var 15)

